000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ВходящиеЗвонкиАстерикс/ВходящиеЗвонкиАстерикс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВходящиеЗвонкиАстерикс</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>НомерОператора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗвонокПринят</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СотрудникКоллЦентра</name>
    <type>
      <types>CatalogRef.СотрудникиКоллЦентра</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Корзина</name>
      <description>КОРЗИНА</description>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
    <items>
      <name>Производители</name>
      <description>Производители</description>
    </items>
  </predefined>
  <attributes>
    <name>Архивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодИзменения</name>
    <comment>NAV: timestamp</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоЕДРПОУ</name>
    <comment>(Регл) Код по ЕДРПОУ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСвидетельстваПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <comment>LNK. Может выступать в роли покупателя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>LNK. Может выступать в роли поставщика</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПрямуюЗакупку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаСобственности</name>
    <type>
      <types>CatalogRef.ФормаСобственности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Дети</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Пол</name>
      <type>
        <types>EnumRef.ПолФизическогоЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МаркетинговыеГруппы</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.МаркетинговыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/HTTPServices/Asterisk/Module.bsl
Функция Call_inPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаЗапроса = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	
	СтруктураДанных = ДесериализаторJSON(СтрокаЗапроса); 
	
	НомерТелефона = СтруктураДанных.customer_number;         
	
	Если СтрДлина(СтруктураДанных.customer_number) = 10 Тогда 
		НомерТелефона = "38" + СтруктураДанных.customer_number;         
	Иначе 
		НомерТелефона = СтрЗаменить(СтруктураДанных.customer_number, "+", "");         
	КонецЕсли;	
		
	Запись = РегистрыСведений.ВходящиеЗвонкиАстерикс.СоздатьМенеджерЗаписи();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона = &НомерТелефона
	|	И КонтрагентыКонтактнаяИнформация.Ссылка.ПометкаУдаления = ЛОЖЬ
    |
	|СГРУППИРОВАТЬ ПО
	|	КонтрагентыКонтактнаяИнформация.Ссылка";
	Запрос.Параметры.Вставить("НомерТелефона", НомерТелефона);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда 
		Контрагент = Результат.Ссылка;
	Иначе 
		Контрагент = НомерТелефона;//Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
	
	Запись.НомерКонтрагента = НомерТелефона;  
	Запись.Контрагент 		= Контрагент;
	Запись.НомерКонтрагента = НомерТелефона;
	Запись.НомерОператора 	= СтруктураДанных.operator_number;
	Запись.Период			= ТекущаяДата();
	Запись.СотрудникКоллЦентра			= РегистрыСведений.РаботаСотрудниковКоллЦентра.ПолучитьСотрудникаПоВнутренниемуНомеру(Запись.НомерОператора);
	Запись.ЗвонокПринят		= ?(Запись.НомерОператора = "NULL", Ложь, Истина);
	
	Если ЗначениеЗаполнено(Контрагент) Тогда 
		РегистрыСведений.ОповещенияПользователя.Установить(Контрагент, "Входящий_Звонок", Запись.СотрудникКоллЦентра.Владелец);	
	КонецЕсли;	
	
	Запись.Записать(Ложь);
	
    УстановитьПривилегированныйРежим(Ложь);

	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

Функция СериализаторJSON(СтруктураДанных) Экспорт 
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции	

Функция ДесериализаторJSON(СтруктураДанных) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(СтруктураДанных);
	
	СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);		
	
	Возврат СтруктураОтвета;
	
КонецФункции
